src/test/resources/data/readable/RCMR_IN030000UK06/WithMidSanitized/envelope.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP:Envelope xmlns:xsi="http://www.w3c.org/2001/XML-Schema-Instance"
               xmlns:SOAP="http://schemas.xmlsoap.org/soap/envelope/"
               xmlns:eb="http://www.oasis-open.org/committees/ebxml-msg/schema/msg-header-2_0.xsd"
               xmlns:hl7ebxml="urn:hl7-org:transport/ebXML/DSTUv1.0" xmlns:xlink="http://www.w3.org/1999/xlink">
    <SOAP:Header>
        <eb:MessageHeader SOAP:mustUnderstand="1" eb:version="2.0">
            <eb:From>
                <eb:PartyId eb:type="urn:nhs:names:partyType:ocs+serviceInstance">A91368-9199177</eb:PartyId>
            </eb:From>
            <eb:To>
                <eb:PartyId eb:type="urn:nhs:names:partyType:ocs+serviceInstance">A91720-9198820</eb:PartyId>
            </eb:To>
            <eb:CPAId>S918999543361</eb:CPAId>
            <eb:ConversationId>ff27abc3-9730-40f7-ba82-382152e6b90a</eb:ConversationId>
            <eb:Service>urn:nhs:names:services:gp2gp</eb:Service>
            <eb:Action>RCMR_IN030000UK06</eb:Action>
            <eb:MessageData>
                <eb:MessageId>1C66BB0E-811E-4956-8F9C-33424695B75F</eb:MessageId>
                <eb:Timestamp>2021-04-30T09:32:00Z</eb:Timestamp>
            </eb:MessageData>
            <eb:DuplicateElimination/>
        </eb:MessageHeader>
        <eb:AckRequested SOAP:mustUnderstand="1" eb:version="2.0" eb:signed="false"
                         SOAP:actor="urn:oasis:names:tc:ebxml-msg:actor:nextMSH"/>
    </SOAP:Header>
    <SOAP:Body>
        <eb:Manifest SOAP:mustUnderstand="1" eb:version="2.0">
            <eb:Reference xlink:href="cid:1C66BB0E-811E-4956-8F9C-33424695B75F@spine.nhs.uk">
                <eb:Schema eb:location="http://www.nhsia.nhs.uk/schemas/HL7-Message.xsd" eb:version="1.0"/>
                <eb:Description xml:lang="en">HL7 payload</eb:Description>
                <hl7ebxml:Payload style="HL7" encoding="XML" version="3.0"/>
            </eb:Reference>
            <eb:Reference xlink:href="mid:38E6D508-888B-4B84-8D33-34C8C0D4B1C3"
                          eb:id="_338CA4A2-32DB-4C84-B85B-F03452F02826" xmlns:xlink="http://www.w3.org/1999/xlink">
                <eb:Description xml:lang="en">Filename="4AB6EDEE-958F-4828-BDA5-B49285A83B3E_sample_1.bin"
                    ContentType=application/octet-stream Compressed=No LargeAttachment=No OriginalBase64=No
                    Length=3670016
                </eb:Description>
            </eb:Reference>
        </eb:Manifest>
    </SOAP:Body>
</SOAP:Envelope>
